IDEA StatiCa Open Model
MaterialBoltGrade.MprlTableID Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Unique ID of MPRL database table where the bolt grade was taken from.
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Guid MprlTableID { get; set; }
Public Property MprlTableID As Guid
	Get
	Set
public:
property Guid MprlTableID {
	Guid get ();
	void set (Guid value);
}
Property Value
Type: Guid
See Also
Reference
MaterialBoltGrade Class
IdeaRS.OpenModel.Material Namespace